gastonfeng/bootloader_stm32/mFirmata.cpp
#ifdef USE_FIRMATA

#include "mFirmata.h"
#include "rtos.h"
#include "plc_const.h"
#include <plc_rte.h>
#include <kSerial.h>

#include "hwboard.h"

#if defined(RTE_APP) || defined(PLC)

#include <iec_types.h>

#endif

#include <ctime>

#ifdef USE_RTC

#include <rte_rtc.h>

#endif

#include <plc_var_class.h>

#ifdef USE_WIFI
#include <iWiFi.h>
#endif
#ifdef USE_SERVO
#include <Servo.h>
#endif

#ifdef USE_FIRMATA_WIRE
#include <Wire.h>
#endif
#ifdef FIRMATA_SERIAL_FEATURE

#include <SerialFirmata.h>

SerialFirmata *serialFeature;
#endif

#ifdef USE_FREERTOS

#include "STM32FreeRTOS.h"

#endif
#ifdef USE_FIRMATA_WIRE
bool isI2CEnabled;
int i2cReadDelayTime;
byte i2cRxData[8];
#endif
int queryIndex;

#ifdef USE_SERVO
Servo servos[MAX_SERVOS];
byte servoPinMap[IO_YO_NRS + IO_XI_NRS + IO_XA_NRS + IO_YA_NRS];
byte detachedServos[MAX_SERVOS];
byte detachedServoCount = 0;
byte servoCount = 0;
#endif
/* pins configuration */
byte portConfigInputs[TOTAL_PORTS];
// each bit: 1 = pin in INPUT, 0 = anything else
#ifndef ARDUINO
// from arduino
#define INPUT 0
#define OUTPUT 1
#endif

#ifdef USE_FIRMATA_WIRE
void wireWrite(byte data)
{
    Wire.write((byte)data);
}

byte wireRead()
{
    return Wire.read();
}

void enableI2CPins()
{
    isI2CEnabled = true;

    Wire.begin();
}
void enableI2CPins(firmata::FirmataClass *fm)
{
    // is there a faster way to do this? would probaby require importing
    // Arduino.h to get SCL and SDA pins
    for (int i = 0; i < TOTAL_PINS; i++)
    {
        if (IS_PIN_I2C(i))
        {
            // mark pins as i2c so they are ignore in non i2c data requests
            setPinModeCallback(fm, i, PIN_MODE_I2C);
        }
    }

    isI2CEnabled = true;

    Wire.begin();
}

/* disable the i2c pins so they can be used for other functions */
void disableI2CPins()
{
    isI2CEnabled = false;
    // disable read continuous mode for all devices
    queryIndex = -1;
}
#endif

void setPinModeCallback(firmata::FirmataClass *fm, byte pin, int mode);

int dbg_size();

void reportAnalogCallback(firmata::FirmataClass *fm, nStream *stream, byte analogPin, int value) {
#if defined(RTE_APP) || defined(PLC)
    if (analogPin < ANALOGVALUE_LENGTH) {
        if (0 == value) {
            (plc_var.info.analogInputsToReport[analogPin / 8]) &= (u8) (~(1 << ((u32) analogPin % 8)));
        } else {
            plc_var.info.analogInputsToReport[analogPin / 8] |= (u8) (1 << ((u32) analogPin % 8));
            // prevent during system reset or all analog pin values will be reported
            // which may report noise for unconnected analog pins
            if (!plc_var.info.isResetting) {
                // Send pin value immediately. This is helpful when connected via
                // ethernet, wi-fi or bluetooth so pin states can be known upon
                // reconnecting.
                fm->sendAnalog(stream, analogPin, plcVar.analogValue(analogPin));
            }
        }
    }
#endif
}

void reportDigitalCallback(firmata::FirmataClass *fm, Stream *, byte port, int value) {
#if defined(RTE_APP) || defined(PLC)
    if (port < IO_XI_NRS + IO_YO_NRS) {
        plc_var.info.reportPINs[port] = value;
        // Send port value immediately. This is helpful when connected via
        // ethernet, wi-fi or bluetooth so pin states can be known upon
        // reconnecting.
        //        if (value)
        //            board.outputPort(port, readPort(port, portConfigInputs[port]), true);
    }
    // do not disable analog reporting on these 8 pins, to allow some
    // pins used for digital, others analog.  Instead, allow both types
    // of reporting to be enabled, but check if the pin is configured
    // as analog when sampling the analog inputs.  Likewise, while
    // scanning digital pins, portConfigInputs will mask off values from any
    // pins configured as analog
#endif
}

void setPinValueCallback(firmata::FirmataClass *fm, Stream *, byte pin, int value) {
#if defined(RTE_APP) || defined(PLC)
    auto *mfm = (mFirmata *) fm;
    if (pin < IO_YO_NRS + IO_XI_NRS + IO_XA_NRS + IO_YA_NRS) //&& fm->getPinMode(pin) == OUTPUT
    {
        mfm->setPinState(pin, value);
        board.outputPort(pin, value);
    }
#endif
}

void systemResetCallback(firmata::FirmataClass *fm, Stream *) {
#if defined(RTE_APP) || defined(PLC)
    plc_var.info.isResetting = true;
    logger.debug("systemResetCallback");
#ifdef FIRMATA_SERIAL_FEATURE
    serialFeature->reset();
#endif
#ifdef USE_FIRMATA_WIRE
    if (isI2CEnabled)
    {
        disableI2CPins();
    }
#endif
    for (unsigned char &reportPIN: plc_var.info.reportPINs)
        reportPIN = 0; // by default, reporting off
    // by default, do not report any analog inputs
    memset(plc_var.info.analogInputsToReport, 0, sizeof(plc_var.info.analogInputsToReport));

    /* send digital inputs to set the initial state on the host computer,
     * since once in the loop(), this firmware will only send on change */

    plc_var.info.isResetting = false;
#endif
}

#ifdef USE_SERVO

void attachServo(firmata::FirmataClass *fm, Stream *fs, byte pin, int minPulse, int maxPulse)
{
    if (servoCount < MAX_SERVOS)
    {
        // reuse indexes of detached servos until all have been reallocated
        if (detachedServoCount > 0)
        {
            servoPinMap[pin] = detachedServos[detachedServoCount - 1];
            if (detachedServoCount > 0)
                detachedServoCount--;
        }
        else
        {
            servoPinMap[pin] = servoCount;
            servoCount++;
        }
        if (minPulse > 0 && maxPulse > 0)
        {
            servos[servoPinMap[pin]].attach(PIN_TO_DIGITAL(pin), minPulse, maxPulse);
        }
        else
        {
            servos[servoPinMap[pin]].attach(PIN_TO_DIGITAL(pin));
        }
    }
    else
    {
        fm->sendString(fs, "Max servos attached");
    }
}

void detachServo(byte pin)
{
    servos[servoPinMap[pin]].detach();
    // if we're detaching the last servo, decrement the count
    // otherwise store the index of the detached servo
    if (servoPinMap[pin] == servoCount && servoCount > 0)
    {
        servoCount--;
    }
    else if (servoCount > 0)
    {
        // keep track of detached servos because we want to reuse their indexes
        // before incrementing the count of attached servos
        detachedServoCount++;
        detachedServos[detachedServoCount - 1] = servoPinMap[pin];
    }

    servoPinMap[pin] = 255;
}
#endif
#ifdef ARDUINO

