gastonfeng/bootloader_stm32/mFirmata.cpp
void setPinModeCallback(firmata::FirmataClass *fm, nStream *Fs, byte pin, int mode) {
    if (fm->getPinMode(pin) == PIN_MODE_IGNORE)
        return;
#ifdef USE_FIRMATA_WIRE
    if (fm->getPinMode(pin) == PIN_MODE_I2C && isI2CEnabled && mode != PIN_MODE_I2C)
    {
        // disable i2c so pins can be used for other functions
        // the following if statements should reconfigure the pins properly
        disableI2CPins();
    }
#endif
#ifdef USE_SERVO
    if (IS_PIN_DIGITAL(pin) && mode != PIN_MODE_SERVO && servoPinMap[pin] < MAX_SERVOS &&
        servos[servoPinMap[pin]].attached())
    {
        detachServo(pin);
    }
#endif
    if (IS_PIN_ANALOG(pin)) {
        reportAnalogCallback(fm, Fs, PIN_TO_ANALOG(pin), mode == PIN_MODE_ANALOG ? 1 : 0); // turn on/off reporting
    }
    if (IS_PIN_DIGITAL(pin)) {
        if (mode == INPUT || mode == PIN_MODE_PULLUP) {
            portConfigInputs[pin / 8] |= (1 << (pin & 7));
        } else {
            portConfigInputs[pin / 8] &= ~(1 << (pin & 7));
        }
    }
    fm->setPinState(pin, 0);
    switch (mode) {
        case PIN_MODE_ANALOG:
            if (IS_PIN_ANALOG(pin)) {
                if (IS_PIN_DIGITAL(pin)) {
                    //
                }
                fm->setPinMode(pin, PIN_MODE_ANALOG);
            }
            break;
        case INPUT:
            if (IS_PIN_DIGITAL(pin)) {
                fm->setPinMode(pin, INPUT);
            }
            break;
        case PIN_MODE_PULLUP:
            if (IS_PIN_DIGITAL(pin)) {
                fm->setPinMode(pin, PIN_MODE_PULLUP);
                fm->setPinState(pin, 1);
            }
            break;
        case OUTPUT:
            if (IS_PIN_DIGITAL(pin)) {
                if (fm->getPinMode(pin) == PIN_MODE_PWM) {
                    // Disable PWM if pin mode was previously set to PWM.
                    digitalWrite(PIN_TO_DIGITAL(pin), LOW);
                }
                fm->setPinMode(pin, OUTPUT);
            }
            break;
        case PIN_MODE_PWM:
            if (IS_PIN_PWM(pin)) {
                analogWrite(PIN_TO_PWM(pin), 0);
                fm->setPinMode(pin, PIN_MODE_PWM);
            }
            break;
#ifdef USE_SERVO

            case PIN_MODE_SERVO:
                if (IS_PIN_DIGITAL(pin))
                {
                    fm->setPinMode(pin, PIN_MODE_SERVO);
                    if (servoPinMap[pin] == 255 || !servos[servoPinMap[pin]].attached())
                    {
                        // pass -1 for min and max pulse values to use default values set
                        // by Servo library
                        attachServo(fm, fs, pin, -1, -1);
                    }
                }
                break;
#endif
#ifdef USE_FIRMATA_WIRE
            case PIN_MODE_I2C:
                if (IS_PIN_I2C(pin))
                {
                    // mark the pin as i2c
                    // the user must call I2C_CONFIG to enable I2C for a device
                    fm->setPinMode(pin, PIN_MODE_I2C);
                }
                break;
#endif
        case PIN_MODE_SERIAL:
#ifdef FIRMATA_SERIAL_FEATURE
            serialFeature->handlePinMode(fm, pin, PIN_MODE_SERIAL);
#endif
            break;
        default:
            fm->sendString(Fs, "Unknown pin mode");
    }
}

#endif

int soem_scan(firmata::FirmataClass *fm, Stream *);

void analogWriteCallback(firmata::FirmataClass *fm, Stream *, byte i, int val) {
#if defined(RTE_APP) || defined(PLC)
    auto v = (u16) val;
    plcVar.analogValue(i, v);
#endif
}

#ifdef USE_LFS

#include "flashFs.h"

extern FlashFs flash_fs;
#endif

void stringCallback(firmata::FirmataClass *fc, nStream *Fs, char *myString) {
#ifdef USE_LFS
    if (strncmp(myString, "rm ", 3) == 0) {
        if (FlashFs::unlink(&myString[3]) == 0)
            fc->sendString(Fs, "rm ok");
        else
            fc->sendString(Fs, "rm fail");
    } else
#endif
    fc->sendString(Fs, "unknown input");
}

int decodeByteStream(size_t bytec, const byte *bytev, byte *buf) {
    u8 bits = 7;
    int i = 0, j = 0;
    u8 a;
    while (i < bytec - 1) {
        a = bytev[i] >> (7 - bits);
        a |= (bytev[i + 1] << bits) & 0xff;
        buf[j++] = a;
        i += 1;
        bits -= 1;
        if (bits == 0) {
            bits = 7;
            i += 1;
        }
    }
    return j;
}


int fill_dbg(int index, u8 *buf);

void set_dbg(u32 index, byte *varp, int len);

void sysexCallback(firmata::FirmataClass *fm, nStream *FirmataStream, byte command, uint16_t argc, byte *argv) {
    int len_data;
    int index;
    char *buffer;
    int state;
    u32 start, end;
    u32 indexv;
    int decodedLen;
    int len;
    u8 *data;
    tm new_time{};
    struct {
        u32 build;
        char name[8];
    } info{};
    byte decodeBuf[16];
    auto *mfm = (mFirmata *) fm;
    // logger.debug("sysexCallback: %d argc=%d,argv=%p", command, argc, argv);
    switch (command) {
        case firmata::ARE_YOU_THERE:
#if defined(RTE_APP) || defined(PLC)
            // logger.disable(logger_t::LOGGER_SERIAL);
#endif
            fm->write(FirmataStream, START_SYSEX);
            fm->write(FirmataStream, firmata::I_AM_HERE);
            fm->write(FirmataStream, 1); // arduino_instance_id
            fm->write(FirmataStream, END_SYSEX);
            fm->flush(FirmataStream);
            break;
        case firmata::I_AM_HERE:
            if (mfm->i_am_here_cb)
                mfm->i_am_here_cb(mfm, FirmataStream);
            break;
#if defined(RTE_APP) || defined(PLC)
        case SAMPLING_INTERVAL:
            if (argc > 1) {
                plc_var.info.samplingInterval = (byte) (argv[0] + (argv[1] << 7));
                if (plc_var.info.samplingInterval < plc_var.config.MINIMUM_SAMPLING_INTERVAL) {
                    plc_var.info.samplingInterval = plc_var.config.MINIMUM_SAMPLING_INTERVAL;
                }
            } else {
                // sendString("Not enough data");
            }
            break;
        case REPORT_ANALOG:
            byte bu[2];
            if (argc == 3) {
                decodeByteStream(argc, (const byte *) argv, bu);
                reportAnalogCallback(fm, FirmataStream, bu[0], bu[1]);
            }
            break;
        case EXTENDED_ANALOG:
            if (argc > 1) {
                int al = argv[1];
                if (argc > 2)
                    al |= (argv[2] << 7);
                if (argc > 3)
                    al |= (argv[3] << 14);
                analogWriteCallback(fm, FirmataStream, argv[0], al);
            }
            break;
        case CAPABILITY_QUERY:
            fm->write(FirmataStream, START_SYSEX);
            fm->write(FirmataStream, CAPABILITY_RESPONSE);
            board.capability_query(fm, FirmataStream);
            fm->write(FirmataStream, END_SYSEX);
            fm->flush(FirmataStream);
            break;
        case PIN_STATE_QUERY:
            if (argc > 0) {
                byte pin = argv[0];
                fm->write(FirmataStream, START_SYSEX);
                fm->write(FirmataStream, PIN_STATE_RESPONSE);
                fm->write(FirmataStream, pin);
                if (pin < IO_YO_NRS + IO_XI_NRS) {
                    fm->write(FirmataStream, fm->getPinMode(pin));
                    fm->write(FirmataStream, (byte) fm->getPinState(pin) & 0x7F);
                    if (fm->getPinState(pin) & 0xFF80)
                        fm->write(FirmataStream, (byte) (fm->getPinState(pin) >> 7) & 0x7F);
                    if (fm->getPinState(pin) & 0xC000)
                        fm->write(FirmataStream, (byte) (fm->getPinState(pin) >> 14) & 0x7F);
                }
                fm->write(FirmataStream, END_SYSEX);
                fm->flush(FirmataStream);
            }
            break;
        case ANALOG_MAPPING_QUERY:
            fm->write(FirmataStream, START_SYSEX);
            fm->write(FirmataStream, ANALOG_MAPPING_RESPONSE);
            board.analog_mapping_query(fm, FirmataStream);

