gastonfeng/bootloader_stm32/mFirmata.cpp
                        ifirmata.dev = mem_block::mems[object];
                        if (!ifirmata.dev) {
                            state = NO_DEVICE;
                        } else {
                            state = ifirmata.dev->begin(&buffer_data[16], len_data - 16, data_address, data_len);
                            if (state > 0 && state > ifirmata.parser.dataBufferSize * 7 / 8 - 4) {
                                state = (int) (ifirmata.parser.dataBufferSize * 7 / 8 - 4);
                            }
                            logger.info("recv %s ,size= %d", &buffer_data[12], *(u32 *) &buffer_data[8]);
                        }
                    }
                } else if (block == -1) {
                    if (ifirmata.dev) {
                        if (ifirmata.dev->Shutdown() < 0) {
                            state = DEVICE_SHUTDOWN_ERR;
                        } else {
                            state = 1;
                            rte.set_state(PLC_STATUS::APP_FLASH_END);
                            logger.info("recv end.");
                            ifirmata.dev = nullptr;
                        }
                    }
                } else {
                    if (ifirmata.dev) {
                        if (ifirmata.dev->Write(&buffer_data[4], len_data - 8) < 0) {
                            state = DEVICE_WRITE_ERR;
                        } else {
                            state = block;
                        }
                        logger.info("recv %d ,size= %d", block, len_data - 8);
                    }
                }
            }
            fm->sendSysex(FirmataStream, FM_PUT_DATA_BLOCK, 4, (byte *) &state);
            free(buffer_data);
            break;
#if defined(RTE_APP) || defined(PLC)
        case FM_GET_LOC_SIZE:
            if (plc_var.info.plc_curr_app) {
                fm->sendSysex(FirmataStream, FM_GET_LOC_SIZE, 2, (byte *) &plc_var.info.plc_curr_app->l_sz);
            } else {
                fm->sendSysex(FirmataStream, FM_GET_LOC_SIZE, 0, (byte *) &plc_var.info.plc_curr_app->l_sz);
            }
            break;
        case FM_GET_LOC_TAB:
            u32 l_index;
            if (argc == 5) {
                decodeByteStream(argc, argv, (byte *) &l_index);
                if (plc_var.info.plc_curr_app && l_index < plc_var.info.plc_curr_app->l_sz) {
                    plc_loc_tbl_t loc = plc_var.info.plc_curr_app->l_tab[l_index];
                    len = (int) sizeof(plc_loc_dsc_t) + loc->a_size + loc->v_size;
                    buffer = (char *) malloc(len);
                    buffer[0] = loc->v_type;
                    buffer[1] = loc->v_size;
                    *(u16 *) &buffer[2] = loc->proto;
                    *(u16 *) &buffer[4] = loc->a_size;
                    memcpy(&buffer[6], loc->a_data, loc->a_size);
                    memcpy(&buffer[6 + loc->a_size], loc->v_buf, loc->v_size);
                    fm->sendSysex(FirmataStream, FM_GET_LOC_TAB, len, (byte *) buffer);
                    free(buffer);
                    break;
                }
            }
            fm->sendSysex(FirmataStream, FM_GET_LOC_TAB, 0, (byte *) &plc_var.info.plc_curr_app->l_sz);
            break;
        case FM_SET_LOC_TAB:
            if (argc == 5) {
                decodeByteStream(argc, argv, (byte *) &l_index);
                if (plc_var.info.plc_curr_app && l_index < plc_var.info.plc_curr_app->l_sz) {
                    fm->sendSysex(FirmataStream, FM_SET_LOC_TAB, sizeof(plc_loc_tbl_t),
                                  (byte *) &plc_var.info.plc_curr_app->l_tab[l_index]);
                    break;
                }
            }
            fm->sendSysex(FirmataStream, FM_SET_LOC_TAB, 0, (byte *) &plc_var.info.plc_curr_app->l_sz);
            break;
#endif
#ifdef ONLINE_DEBUG
        case FM_GET_DBG_SIZE:
            if (plc_var.info.plc_curr_app) {
                fm->sendSysex(FirmataStream, FM_GET_DBG_SIZE, 4,
                              (byte *) &plc_var.info.plc_curr_app->data->size_dbgvardsc);
            } else {
                fm->sendSysex(FirmataStream, FM_GET_DBG_SIZE, 0, nullptr);
            }
            break;
        case FM_GET_DBG:
            len = 0;
            if (argc == 5) {
                decodeByteStream(argc, argv, (byte *) &l_index);
                if (plc_var.info.plc_curr_app && l_index < plc_var.info.plc_curr_app->data->size_dbgvardsc) {
                    len = (int) fill_dbg((int) l_index, decodeBuf);
                }
            }
            fm->sendSysex(FirmataStream, FM_GET_DBG, len, decodeBuf);
            break;
        case FM_SET_DBG:
            len = 0;
            if (argc > 5) {
                decodedLen = decodeByteStream(argc, argv, (byte *) &decodeBuf);
                l_index = *(u32 *) decodeBuf;
                if (plc_var.info.plc_curr_app && l_index < plc_var.info.plc_curr_app->data->size_dbgvardsc) {
                    set_dbg(l_index, &decodeBuf[4], decodedLen - 4);
                    len = (int) fill_dbg((int) l_index, decodeBuf);
                }
            }
            fm->sendSysex(FirmataStream, FM_GET_DBG, len, decodeBuf);
            break;
#endif
#if defined(RTE_APP) || defined(PLC)
        case FM_LOG_SET_LEVEL:
            plc_var.config.log_level = argv[0];
            fm->sendSysex(FirmataStream, FM_LOG_SET_LEVEL, 1, &plc_var.config.log_level);
            break;
#endif
#ifdef ARDUINO_ARCH_STM32
        case FM_GET_CPU_SN:
            u32 sn[3];
            sn[0] = HAL_GetUIDw0();
            sn[1] = HAL_GetUIDw1();
            sn[2] = HAL_GetUIDw2();
            fm->sendSysex(FirmataStream, FM_GET_CPU_SN, 12, (byte *) sn);
            break;
#endif
#if defined(RTE_APP) || defined(PLC)
        case FM_READ_MEM:
            decodedLen = decodeByteStream(argc, argv, decodeBuf);
            indexv = 0;
            len = 0;
            if (decodedLen == 6) {
                indexv = *(u32 *) decodeBuf;
                len = *(u16 *) &decodeBuf[4];
            }
            fm->sendSysex(FirmataStream, FM_READ_MEM, len, (byte *) indexv);
            break;
        case FM_WRITE_MEM:
            if (argc > 6) {
                buffer = (char *) malloc(argc);
                decodedLen = decodeByteStream(argc, argv, (byte *) buffer);
                indexv = *(u32 *) buffer;
                len = *(u16 *) &buffer[4];
                for (int i = 0; i < len; ++i) {
                    *((uint8_t *) indexv + i) = buffer[6 + i];
                }
                fm->sendSysex(FirmataStream, FM_WRITE_MEM, len, (byte *) indexv);
                free(buffer);
            }
            break;
        case FM_READ_VALUE:
            u8 region, typ;
            byte *rdbuf;
            if (argc < 9)
                break;
            rdbuf = (byte *) malloc(FirmataStream->tx_max_size());
            decodedLen = decodeByteStream(argc, argv, rdbuf);
            indexv = 0;
            len = 0;
            if (decodedLen == 8 && rdbuf[0] <= REGION_HOLDER) {
                region = rdbuf[0];
                indexv = *(u32 *) &rdbuf[1];
                if (indexv > 256)
                    indexv = 0;;
                typ = rdbuf[5];
                len = *(u16 *) &rdbuf[6];
                if (len > 256)
                    len = 0;
                rdbuf[0] = region;
                rdbuf[1] = typ;
                *(u32 *) &rdbuf[2] = indexv;
                const char *p;
                switch (region) {
                    default:
                        p = (const char *) &plc_var.digitalValue;
                        break;
                    case REGION_XI:      // byte from 0
                    case REGION_DIGITAL: // digitalValue
                        memset(argv, 0, argc);
                        for (int i = 0; i < len; i++) {
                            if (plcVar.digitalValue(i + indexv))
                                argv[i / 8] |= (1 << (i % 8));
                        }
                        p = (const char *) argv;
                        len = (len + 7) / 8;
                        indexv = 0;
                        break;
                    case REGION_16: // analogValue
                        p = (const char *) &plc_var.analogValue;
                        break;
                    case REGION_32: // analogValue32
                        p = (const char *) &plc_var.analogValue32;
                        break;
                    case REGION_HOLDER: // holdValue
                        p = (const char *) &plc_var.holdValue;
                        break;
                    case REGION_INFO:
                        p = (const char *) &plc_var.info;
                        break;
                    case REGION_CONFIG:
                        p = (const char *) &plc_var.config;
                        break;
                }
                memcpy(&rdbuf[6], &p[indexv], len);
                fm->sendSysex(FirmataStream, FM_READ_VALUE_REP, len + 6, (byte *) rdbuf);
            } else
                fm->sendSysex(FirmataStream, FM_READ_VALUE_REP, len, ((byte *) &plc_var) + indexv);
            free(rdbuf);
            break;
        case FM_WRITE_VALUE:
            if (argc > 7) {
                buffer = (char *) malloc(argc);
                decodedLen = decodeByteStream(argc, argv, (byte *) buffer);
                region = buffer[0];
                indexv = *(u32 *) &buffer[1];
                len = *(u16 *) &buffer[5];
                char *p;
                switch (region) {
                    default:
                        p = ((char *) &plc_var.digitalValue);
                        break;
                    case REGION_XI:      // byte from 0
                    case REGION_DIGITAL: // digitalValue
                        u8 v;
                        v = ((char *) &plc_var.digitalValue)[indexv / 8];
                        if (buffer[7] == 1) {
                            buffer[7] = v | (1 << (indexv % 8));
                        } else {
                            buffer[7] = v & ~(1 << (indexv % 8));
                        }
                        indexv = indexv / 8;
                        len = (len + 7) / 8;
                        p = ((char *) &plc_var.digitalValue);
                        break;
                    case REGION_16: // analogValue
                        p = (char *) &plc_var.analogValue;
                        break;
                    case REGION_32: // analogValue32
                        p = (char *) &plc_var.analogValue32;
                        break;
                    case REGION_HOLDER: // holdValue
                        p = (char *) &plc_var.holdValue;
                        break;
                    case REGION_INFO:
                        p = (char *) &plc_var.info;
                        break;
                    case REGION_CONFIG:
                        p = (char *) &plc_var.config;
                        break;
                }
                memcpy(p + indexv, &buffer[7], len);
                fm->sendSysex(FirmataStream, FM_WRITE_VALUE_REP, 7, (byte *) buffer);
                free(buffer);
            }
            break;
        case FM_READ_BIT:
            decodedLen = decodeByteStream(argc, argv, decodeBuf);
            indexv = 0;
            len = 0;
            if (decodedLen == 6) {
                indexv = *(u32 *) decodeBuf;
                len = *(u16 *) &decodeBuf[4];
            }
            if (len > 0) {
                buffer = (char *) malloc(len / 8 + 6);
                *(u32 *) buffer = indexv;
                buffer[4] = len;
                for (int i = 0; i < len; i++) {
                    u8 b = plcVar.digitalValue(indexv + i);
                    buffer[i / 8 + 5] |= b << (i % 8);
                }
                fm->sendSysex(FirmataStream, FM_READ_BIT_REP, len / 8 + 6, (byte *) buffer);
                free(buffer);
            }
            break;
        case FM_WRITE_BIT:
            if (argc > 6) {
                buffer = (char *) malloc(argc);
                decodedLen = decodeByteStream(argc, argv, (byte *) buffer);
                indexv = *(u32 *) buffer;
                len = *(u16 *) &buffer[4];
                if (len < (argc - 6)) {
                    for (int i = 0; i < len; i++) {
                        *(((uint8_t *) &plc_var) + indexv + i) = buffer[6 + i];
                    }
                }
                fm->sendSysex(FirmataStream, FM_WRITE_VALUE_REP, len,
                              (byte *) ((uint8_t *) &plc_var) + indexv);
                free(buffer);
            }
            break;
#endif
        case FM_READ_VALUE_REP:
            if (argc > 0) {
                decodedLen = decodeByteStream(argc, argv, decodeBuf);
                memcpy(mfm->valueBuf, decodeBuf, decodedLen);
                mfm->valueLen = decodedLen;
            }
            break;
        case FM_WRITE_VALUE_REP:
            if (argc > 0 && argc < 8) {
                decodedLen = decodeByteStream(argc, argv, decodeBuf);
            }
            break;
        case FM_READ_BIT_REP:
            if (argc > 0 && argc < 16) {
                decodedLen = decodeByteStream(argc, argv, decodeBuf);
                memcpy(mfm->valueBuf, decodeBuf, decodedLen);
                mfm->valueLen = decodedLen;
            }
            break;
        case FM_WRITE_BIT_REP:
            if (argc > 0 && argc < 8) {
                decodedLen = decodeByteStream(argc, argv, decodeBuf);
            }
            break;
        case FM_GET_LOCATION:
            byte *buf_fgl;
            buf_fgl = (byte *) malloc(32);
            decodedLen = decodeByteStream(argc, argv, decodeBuf);
            len = 0;
            if (decodedLen >= 4) {
                len = board.get_input(decodeBuf[1], decodeBuf[2], decodeBuf[3], 0, buf_fgl);
            }
            fm->sendSysex(FirmataStream, FM_GET_LOCATION, len, (byte *) buf_fgl);
            free(buf_fgl);
            break;
        case FM_SET_LOCATION:
            decodedLen = decodeByteStream(argc, argv, decodeBuf);
            len = -1;
            if (decodedLen >= 6) {
                len = board.set_output(decodeBuf[1], decodeBuf[2], decodeBuf[3], 0, &decodeBuf[5], decodeBuf[4]);
            }
            fm->sendSysex(FirmataStream, FM_SET_LOCATION, 4, (byte *) &len);
            break;
        case CB_GOTO_IAP:
            fm->sendSysex(FirmataStream, CB_GOTO_IAP, 0, nullptr);
            boardBase::goto_iap();
        case CB_RESET:
            len = 1;
            fm->sendSysex(FirmataStream, CB_RESET, 4, (byte *) &len);
            boardBase::reset();
            hwboard::reset();
            break;
        default:
            len = -1;
            logger.error("sysexCallback: %d argc=%d,argv=%p", command, argc, argv);
            // fm->sendSysex(FirmataStream, command, 4, (byte *) &len);
            break;
    }
    mfm->set_flag(command);
}

void digitalWriteCallback(firmata::FirmataClass *fm, nStream *FirmataStream, byte port, int value) {
#if defined(RTE_APP) || defined(PLC)
    byte lastPin, pinValue, mask = 1, pinWriteMask = 0;

    if (port < IO_XI_NRS + IO_YO_NRS) {
        // create a mask of the pins on this port that are writable.
        lastPin = port * 8 + 8;
        if (lastPin > IO_YO_NRS + IO_XI_NRS + IO_XA_NRS + IO_YA_NRS)
            lastPin = IO_YO_NRS + IO_XI_NRS + IO_XA_NRS + IO_YA_NRS;
#ifdef ARDUINO
        for (byte pin = port * 8; pin < lastPin; pin++) {
            // do not disturb non-digital pins (eg, Rx & Tx)
            if (IS_PIN_DIGITAL(pin) && (fm->getPinMode(pin) == OUTPUT || fm->getPinMode(pin) == INPUT)) {
                pinValue = ((byte) value & mask) ? 1 : 0;
                if (fm->getPinMode(pin) == OUTPUT) {
                    pinWriteMask |= mask;
                } else if (fm->getPinMode(pin) == INPUT && pinValue == 1 && fm->getPinState(pin) != 1) {
                    // only handle INPUT here for backwards compatibility
#if ARDUINO > 100
                    // pinMode(pin, INPUT_PULLUP);
#else
                    // only write to the INPUT pin to enable pullups if Arduino v1.0.0 or earlier
                    pinWriteMask |= mask;
#endif
                }
                board.setPinState(fm, FirmataStream, pin, pinValue);
            }
            mask = (byte) (mask << 1);
        }
        writePort(port, (byte) value, pinWriteMask);
#endif
    }
#endif
}

int mFirmata::loop(nStream *FirmataStream) {
    while (available(FirmataStream)) {
        processInput(FirmataStream);
        plc_var.info.task_busy |= 0x2;
        last_tick = rtos::ticks();
    }
#if defined(RTE_APP) || defined(PLC)
    report(FirmataStream);
#endif
    return 0;
}

mFirmata::mFirmata() {
}

#if defined(RTE_APP) || defined(PLC)

